import { Hero } from './hero';

export const HEROES: Hero[] = [
  { id: 1, name: '夏',
    detail: '夏朝（约前2070-前1600）是中国史书中记载的第一个世袭制朝代。夏时期的文物中有一定数量的青铜和玉制的礼器，年代约在新石器时代晚期、青铜时代初期。' +
            '根据史书记载，禹传位于子启，改变了原始部落的禅让制，开创中国近四千年世袭的先河。因此中国历史上的“家天下”，从夏朝的建立开始。' +
            '夏族的十一支姒姓部落与夏后氏中央王室在血缘上有宗法关系，政治上有分封关系，经济上有贡赋关系，大致构成夏王朝的核心领土范围。' +
            '夏西起河南省西部、山西省南部，东至河南省、山东省和河北省三省交界处，南达湖北省北部，北及河北省南部。' +
            '一般认为，夏朝共传十四代，十七后（夏朝统治者在位时称”后“，去世后称”帝“），延续约471年 ，为商朝所灭。后人常以“华夏”自称，使之成为中国的代名词 。' },
  { id: 2, name: '商',
    detail: '商朝（约公元前1600年—约公元前1046年），是中国历史上的第二个朝代，是中国第一个有直接的同时期的文字记载的王朝。' +
            '夏朝方国商国君主商汤率方国于鸣条之战灭夏后，以“商”为国号，在亳（今商丘） 建立商朝。之后，商朝国都频繁迁移，' +
            '至其后裔盘庚迁殷（今安阳）后国都才稳定下来，在殷建都达273年，因此商朝又被后世称为“殷”或“殷商”。' +
            '商朝经历了三个大的阶段。第一阶段是“先商”；第二阶段是“早商”；第三阶段是“晚商”，前后相传17世31王，延续500余年。' +
            '末代君主帝辛于牧野之战被周武王击败后自焚而亡。殷墟的发掘，确证了中国商王朝的存在。' +
            '商朝处于奴隶制鼎盛时期，奴隶主贵族是统治阶级，形成了庞大的官僚统治机构和军队。' +
            '甲骨文和金文的记载是目前已经发现的中国最早的成系统的文字符号。在商朝时期，长江流域也平行存在发达的非中原文明.' },
  { id: 3, name: '西周' ,
     detail: ' 西周（前1046年―前771年）是由周文王之子周武王灭商后所建立，至公元前771年周幽王被申侯和犬戎所杀为止，共经历11代12王，' +
             '大约历经275年。定都于镐京和丰京（今陕西西安西南），成王五年营建东都成周洛邑（洛阳）。' +
             '历史上将东迁之前那一时期的周朝称为西周。周朝是中国远古社会的鼎盛时期。从西周开始，进行境内各个民族与部落不断融合的过程，' +
             '在这期间，华夏族逐步形成，成为现代汉民族的前身。从周朝开始，进行境内各个民族与部落不断融合的过程，其它还有夷、蛮、越、戎狄、' +
             '肃慎、东胡等诸多少数民族。西周国野之制最为典型，到春秋时期国野之制开始瓦解，到战国则普遍为郡县。' +
             '西周后期社会矛盾包括统治集团内部矛盾日趋激化，对土地以及政权的争夺，加速了西周的灭亡。国人暴动动摇了西周统治的基础，' +
             '公元前771年，周幽王被犬戎杀死，西周灭亡了。'},
  { id: 4, name: '东周', detail: '东周（前770年－前256年），中国历史上继西周之后的朝代，诸侯拥立原先被废的太子宜臼为王，史称周平王，延续周朝，' +
                 '定都洛邑（今河南洛阳），史称东周，以别于西周。东周的前半期，诸侯争相称霸，称为春秋时代；公元前453年，韩赵魏三家联手灭智氏家族后，' +
                 '三家分晋，各诸侯相互征伐，称为战国时代.平王东迁以后，管辖范围大减，形同一个小国，加上有弑父之嫌，在诸侯中的威望已经大不如前。' +
                 '据《左传》记载，春秋时共有140多诸侯国。面对诸侯之间互相攻伐和兼并，边境的外族又乘机入侵，天子不能担负共主的责任，' +
                 '经常要向一些强大的诸侯求助。在这情况下，强大的诸侯便自居霸主，中原诸侯对四夷侵扰则“尊王攘夷口号团结自卫。' +
                 '周襄王十七年（前635年），发生子带之乱，襄王不能平，求救于晋文公，文公诛叔带，遂为伯而得河内地 。周襄王二十年（前632年），' +
                 '襄王为晋文公所迫，于河阳践土会盟 。周赧王时，国势益弱，同时内部争斗不休，以至分为东周国和西周国。赧王迁都西周。' +
                 '周赧王八年（前307年），秦借道两周之间攻韩，周人两边都不敢得罪，左右为难。东西两周位于诸强国之间，不能同心协力，反而彼此攻杀。' +
                 '至赧王五十九年（前256年），西周国被秦所灭，同年赧王病死，西周覆亡。七年后，东周国亦被秦所灭 。东周共传25王，历时515年, ' +
                 '这一时期是中国的社会制度转变的时期，以铁器的广泛使用为标志。' },
  { id: 5, name: '秦', detail: ' 秦朝（公元前221年－公元前207年），是由战国时期的秦国发展起来的中国历史上第一个大一统王朝，第一个统一的中央集权的封建王朝秦,' +
                 '共两帝一王，国祚共十四年。因秦朝王室为嬴姓，故史书上别称嬴秦，以区分其他国号为秦的政权。' +
                 '秦国原为周朝的一个诸侯国，到秦始皇继位后，于公元前230年到前221年先后攻灭关东六国，完成华夏大一统，后北击匈奴、南并百越，建立了国土空前辽阔的王朝。' +
                 '秦始皇死后，秦二世胡亥与赵高合谋篡改秦法导致秦末农民起义。公元前207年，秦王子婴向刘邦投降，秦朝灭亡。' +
                 '秦朝创立帝制及以三公九卿为代表的中央官制，废除分封制代以郡县制，彻底打破自西周以来的世卿世禄制度，强力维护了国家的统一，' +
                 '强化中央对地方的控制，又推行车同轨、书同文、行同伦统一文化风俗，加强了大一统的凝聚力，奠定中国大一统王朝的统治基础，故称“百代都行秦政法” 。' +
                 '秦朝结束了自春秋战国以来五百年来诸侯分裂割据的局面，成为中国历史上第一个多民族共融的中央集权制国家。'},
  { id: 6, name: '汉', detail: ' 汉朝（前202年—220年）是继秦朝之后的大一统王朝，分为西汉、东汉时期，共历29帝，享国四百零七年。因皇室姓刘，' +
                 '故又称刘汉，是中国最强盛的时代之一。秦末天下大乱，刘邦在推翻秦朝后被封为汉王。公元前202年，楚汉之争获胜后称帝建立汉朝，' +
                 '定都长安，史称西汉；汉文帝、汉景帝推行休养生息国策开创“文景之治”；汉武帝即位后攘夷拓土成就“汉武盛世”；至汉宣帝时期国力达到极盛 ，' +
                 '史称“孝宣中兴” 。公元8年，儒生王莽废西汉末帝，定都长安，史称新朝，西汉灭亡。 公元25年，刘秀称帝建立东汉，定都洛阳，' +
                 '统一天下后息兵养民，史称“光武中兴”；汉明帝、汉章帝沿袭轻徭薄赋，开创“明章之治”；汉和帝继位后大破北匈奴、收复西域，开创“永元之隆”' +
                 '，东汉国力达到极盛。公元184年爆发黄巾起义，虽剿灭民乱却导致地方拥兵自重，董卓之乱后东汉名存实亡。公元220年曹丕篡汉，东汉灭亡，' +
                 '后刘备建立蜀汉延续汉室，中国进入三国时期。汉朝和约略同时期欧洲的罗马帝国并列为当时世界上最强大帝国。两汉时期奠定汉地范围，' +
                 '极盛时东并朝鲜、南包越南、西逾葱岭、北达戈壁，国土面积约达609万平方公里。公元2年，西汉全国人口达六千余万 ，占当时世界的三分之一。' +
                 '华夏族自汉朝以后逐渐被称为汉族，两汉在科技领域亦颇有成就，如蔡伦改进了造纸术，成为中国四大发明之一，张衡发明了地动仪、浑天仪等。' },
  { id: 7, name: '三国（魏 蜀 吴）', detail : '三国（220年－280年）是上承东汉下启西晋的一段历史时期，分为曹魏、蜀汉、东吴三个政权。赤壁之战时，' +
                 '曹操被孙刘联军击败，奠定了三国鼎立的雏型。220年，曹丕篡汉称帝，国号“魏”，史称曹魏，三国历史正式开始。次年刘备在成都延续汉朝，' +
                 '史称蜀汉。222年刘备在夷陵之战失败，孙权获得荆州大部。223年刘备去世，诸葛亮辅佐刘备之子刘禅与孙权重新联盟。229年孙权称帝，国号“吴”，' +
                 '史称东吴，至此三国正式成立。 此后的数十年内，蜀汉诸葛亮、姜维多次率军北伐曹魏，但始终未能改变三足鼎立的格局。' +
                 '曹魏后期的实权渐渐被司马懿掌控。263年，曹魏的司马昭发动魏灭蜀之战，蜀汉灭亡。两年后司马昭病死，其子司马炎废魏元帝自立，' +
                 '建国号为“晋”，史称西晋。公元280年，西晋灭东吴，统一中国，至此三国时期结束，进入晋朝时期。' },
  { id: 8, name: '晋（东晋 西晋）', detail : ' 晋朝（266年－420年）上承三国下启南北朝，分为西晋与东晋两个时期，其中西晋为中国历史上大一统王朝之一，' +
                 '东晋则属于六朝之一，两晋共传十五帝，共一百五十五年。 266年司马炎篡魏，建国号为晋，定都洛阳，史称西晋，280年灭吴，完成统一。' +
                 '后经历八王之乱和永嘉之祸，国势渐衰，316年西晋被北方蛮族灭亡，北方陷于混乱，史称五胡乱华。317年，晋室南渡，司马睿在建邺建立东晋，' +
                 '东晋曾多次北伐。383年东晋与前秦淝水之战后得到暂时巩固。两晋时期五胡迁至中原，加强了民族融合，北人南迁，开发了江南地区。420年，' +
                 '刘裕建立刘宋，东晋灭亡。中国历史进入了南北朝时期。西晋承袭曹魏领土，统一后又占有孙吴疆域。东晋随其疆域的变化而有增减，' +
                 '北界主要在秦岭淮河一线。两晋的政治体制为世族政治，是隋唐的三省六部制的基础。而晋朝时期的农业、商业、手工业等相比较三国时期有了进一步发展。' +
                 '晋朝虽为汉末以来中国文化中衰时期，但在哲学、文学、艺术、史学、科技等方面也有新的发展。两晋的文化走向多元发展，' +
                 '是一个文化开创、冲突又融合的时代，由于儒教独尊的地位被打破，哲学、文学、艺术、史学及科技纷纷出现革新，有些成为独立的学问。' +
                 '当代思想有由本土发展的玄学、道教及由印度东传的佛教，士大夫纷纷盛行清谈。由于边疆民族带来草原文化，' +
                 '东晋则拥有中原文化及江南文化，双方逐渐展开文化交流或民族融合。' },
  { id: 9, name: '北朝', detail : '北朝（386年—581年），指中国南北朝时期存在于北方五个朝代的总称。 北朝包括北魏、东魏、西魏、北齐和北周五朝' +
                 '（继承北周疆域的隋由于灭亡南朝陈，完成了统一大业，所以没被称作北隋，而是被后世称为隋朝）。' +
                 '从北魏统一北方开始到隋文帝建立隋朝为止，与南方地区相继出现了宋、齐、梁、陈四个朝代对峙，合称南北朝。' +
                 '唐朝官修正史尊奉南北朝共为正统。北周大定元年（公元581年）二月，周静帝帝位禅让于杨坚，即隋文帝，建立隋朝，北朝结束。' +
                 '北朝结束了中国从八王之乱起将近一百五十年的中原混战的局面。后世的隋唐两朝都是继承了北朝，他们的开国皇帝们的祖先都是北朝名贵，' +
                 '并且又从军事和政治制度等各个领域都沿袭北朝并加以更好的发展和创新，奠定了隋唐盛世和民族大融合的基础。' },
  { id: 10, name: '隋', detail : '隋朝（581年—618年或619年）是中国历史上承南北朝下继唐朝的大一统王朝。581年二月，北周静帝禅让帝位于杨坚，' +
                  '北周覆亡。杨坚定国号为“隋”，定都大兴城。随后于589年南下灭陈朝，统一中国，结束了自西晋末年以来长达近300年的分裂局面。' +
                  '605年，隋炀帝即位后，令宇文恺营建东都洛阳，并于606年颁布诏书迁都洛阳。隋文帝在位年间社会民生富庶、人民安居乐业、政治安定，' +
                  '开创了开皇之治的繁荣局面。隋炀帝在位时期修建了贯通南北的大运河，但因过度消耗国力，引发隋末民变和贵族叛变。' +
                  '618年宇文化及等人发动兵变，杀隋炀帝；隋恭帝杨侑禅让李渊，李渊称帝，建立唐朝。619年，王世充拥立的皇泰主杨侗也被废，' +
                  '隋朝灭亡，享国38年。' },
  { id: 11, name: '唐', detail : ' 唐朝（618年—907年），是继隋朝之后的大一统王朝，共历二十一帝，享国二百八十九年，因皇室姓李，故又称为李唐，' +
                  '是公认的中国最强盛的时代之一。隋末天下群雄并起，617年，唐国公李渊晋阳起兵，次年于长安称帝建立唐朝。唐太宗继位后开创贞观之治。' +
                  '唐高宗承贞观遗风开创“永徽之治”。690年，武则天以周代唐，定都洛阳，史称武周。705年，神龙革命后，唐中宗恢复唐朝国号。' +
                  '唐玄宗即位后励精图治，开创了万邦来朝的开元盛世。天宝末全国人口达八千万上下。安史之乱后藩镇割据、宦官专权导致国力渐衰，' +
                  '中后期经唐宪宗元和中兴、唐武宗会昌中兴、唐宣宗大中之治国势复振。878年，爆发黄巢起义破坏了唐朝统治根基，907年，朱温篡唐，' +
                  '唐朝覆亡，中国进入五代十国。唐朝是版图最大，亦是唯一未修建长城的大一统中原王朝。唐代国土在西部及北部皆超出现代中国的疆界范围。' +
                  '唐朝自攻灭东突厥、薛延陀后，天子被四夷各族尊为天可汗 ，又借羁縻制度征调突厥、回鹘、铁勒、契丹、靺鞨、室韦等民族攻伐敌国，' +
                  '并让南诏、新罗、渤海国、日本等藩属国学习自身的文化与制度。' },
  { id: 12, name: '宋', detail : '宋朝（960年—1279年）是中国历史上承五代十国下启元朝的朝代，分北宋和南宋两个阶段，共历十八帝，' +
                  '享国三百一十九年。960年，后周诸将发动陈桥兵变，拥立宋州归德军节度使赵匡胤为帝，建立宋朝。' +
                  '赵匡胤为避免晚唐藩镇割据和宦官专权乱象，采取重文抑武方针，加强中央集权，并剥夺武将兵权。宋太宗继位后统一全国，' +
                  '宋真宗与辽国缔结澶渊之盟后逐渐步入治世。1125年金国大举南侵，导致靖康之耻，北宋灭亡。康王赵构于南京应天府即位，' +
                  '建立了南宋。绍兴和议后与金国以秦岭-淮河为界，1234年联蒙灭金，1235年爆发宋元战争，1276年元朝攻占临安，崖山海战后，' +
                  '南宋灭亡。' },
  { id: 13, name: '元', detail : '元朝（1271年—1368年），由蒙古族建立，是中国历史上首次由少数民族建立的大一统王朝。定都大都（今北京），' +
                  '传五世十一帝，历时九十八年。1206年，成吉思汗铁木真统一漠北建立蒙古帝国后开始对外扩张，先后攻灭西辽、西夏、' +
                  '花剌子模、东夏、金等国。蒙哥汗去世后，引发了阿里不哥与忽必烈的汗位之争，促使大蒙古国分裂。1260年忽必烈即汗位，' +
                  '建元“中统”。1271年，忽必烈取《易经》“大哉乾元”之意改国号为“大元”，次年迁都燕京，称大都。1279年（至元十六年），' +
                  '元军在崖山海战消灭南宋，结束了长期的战乱局面。之后元朝持续对外扩张，但在出海征伐日本和东南亚诸国时屡遭失利，' +
                  '如元日战争、元越战争、元缅战争、元爪战争等。元中期政变频繁，政治始终未上正轨。后期政治腐败，权臣干政，' +
                  '民族矛盾与阶级矛盾日益加剧，导致元末农民起义。1368年，朱元璋称帝建立明朝，随后北伐驱逐元廷攻占北京。' +
                  '此后元廷退居漠北，史称北元。1402年，元臣鬼力赤篡夺政权建立鞑靼，北元灭亡。' },
  { id: 14, name: '明', detail : '明朝（1368年―1644年）是中国历史上最后一个由汉族建立的大一统王朝，共传十六帝，享国二百七十六年。' +
                  '元末民不聊生，爆发红巾起义，朱元璋加入郭子兴队伍。1364年朱元璋称吴王，建立西吴。1368年朱元璋称帝，国号为大明，' +
                  '因皇室姓朱，又称朱明，定都于应天府；1420年朱棣迁都至顺天府，以应天府为陪都。明初历经洪武之治、永乐盛世、' +
                  '仁宣之治等治世，政治清明、国力强盛。中期经土木之变由盛转衰，后经弘治中兴、嘉靖中兴、万历中兴国势复振，' +
                  '晚明因东林党争和天灾外患导致国力衰退，爆发农民起义。1644年李自成攻入北京，崇祯帝自缢殉国，明朝覆灭。明朝宗室在江南建立南明，' +
                  '随后清朝击败大顺、大西、南明弘光、隆武、绍武等诸政权。1662年永历帝被杀，南明覆灭。1683年清军攻占台湾，奉明正朔的明郑覆灭。' },
];

