import { Hero } from './hero';

export const HEROES: Hero[] = [
  { id: 1, name: '夏',
    detail: '夏朝（约前2070-前1600）是中国史书中记载的第一个世袭制朝代。夏时期的文物中有一定数量的青铜和玉制的礼器，年代约在新石器时代晚期、青铜时代初期。' +
            '根据史书记载，禹传位于子启，改变了原始部落的禅让制，开创中国近四千年世袭的先河。因此中国历史上的“家天下”，从夏朝的建立开始。' +
            '夏族的十一支姒姓部落与夏后氏中央王室在血缘上有宗法关系，政治上有分封关系，经济上有贡赋关系，大致构成夏王朝的核心领土范围。' +
            '夏西起河南省西部、山西省南部，东至河南省、山东省和河北省三省交界处，南达湖北省北部，北及河北省南部。' +
            '一般认为，夏朝共传十四代，十七后（夏朝统治者在位时称”后“，去世后称”帝“），延续约471年 ，为商朝所灭。后人常以“华夏”自称，使之成为中国的代名词 。' },
  { id: 2, name: '商',
    detail: '商朝（约公元前1600年—约公元前1046年），是中国历史上的第二个朝代，是中国第一个有直接的同时期的文字记载的王朝。' +
            '夏朝方国商国君主商汤率方国于鸣条之战灭夏后，以“商”为国号，在亳（今商丘） 建立商朝。之后，商朝国都频繁迁移，' +
            '至其后裔盘庚迁殷（今安阳）后国都才稳定下来，在殷建都达273年，因此商朝又被后世称为“殷”或“殷商”。' +
            '商朝经历了三个大的阶段。第一阶段是“先商”；第二阶段是“早商”；第三阶段是“晚商”，前后相传17世31王，延续500余年。' +
            '末代君主帝辛于牧野之战被周武王击败后自焚而亡。殷墟的发掘，确证了中国商王朝的存在。' +
            '商朝处于奴隶制鼎盛时期，奴隶主贵族是统治阶级，形成了庞大的官僚统治机构和军队。' +
            '甲骨文和金文的记载是目前已经发现的中国最早的成系统的文字符号。在商朝时期，长江流域也平行存在发达的非中原文明.' },
  { id: 3, name: '西周' ,
     detail: ' 西周（前1046年―前771年）是由周文王之子周武王灭商后所建立，至公元前771年周幽王被申侯和犬戎所杀为止，共经历11代12王，' +
             '大约历经275年。定都于镐京和丰京（今陕西西安西南），成王五年营建东都成周洛邑（洛阳）。' +
             '历史上将东迁之前那一时期的周朝称为西周。周朝是中国远古社会的鼎盛时期。从西周开始，进行境内各个民族与部落不断融合的过程，' +
             '在这期间，华夏族逐步形成，成为现代汉民族的前身。从周朝开始，进行境内各个民族与部落不断融合的过程，其它还有夷、蛮、越、戎狄、' +
             '肃慎、东胡等诸多少数民族。西周国野之制最为典型，到春秋时期国野之制开始瓦解，到战国则普遍为郡县。' +
             '西周后期社会矛盾包括统治集团内部矛盾日趋激化，对土地以及政权的争夺，加速了西周的灭亡。国人暴动动摇了西周统治的基础，' +
             '公元前771年，周幽王被犬戎杀死，西周灭亡了。'}
  { id: 4, name: '东周', detail: ' 东周（前770年－前256年），诸侯拥立原先被废的太子宜臼为王，史称周平王，延续周朝，定都洛邑，史称东周，以别于西周。' +
                 '东周的前半期，诸侯争相称霸，称为春秋时代；公元前453年，各诸侯相互征伐，称为战国时代。' },
  { id: 5, name: '秦', detail: ' 秦朝（公元前221年－公元前207年），是由战国时期的秦国发展起来的中国历史上第一个大一统王朝，第一个统一的中央集权的封建王朝秦,' +
                 '共两帝一王，国祚共十四年。因秦朝王室为嬴姓，故史书上别称嬴秦，以区分其他国号为秦的政权。' +
                 '秦国原为周朝的一个诸侯国，到秦始皇继位后，于公元前230年到前221年先后攻灭关东六国，完成华夏大一统，后北击匈奴、南并百越，建立了国土空前辽阔的王朝。' +
                 '秦始皇死后，秦二世胡亥与赵高合谋篡改秦法导致秦末农民起义。公元前207年，秦王子婴向刘邦投降，秦朝灭亡。' +
                 '秦朝创立帝制及以三公九卿为代表的中央官制，废除分封制代以郡县制，彻底打破自西周以来的世卿世禄制度，强力维护了国家的统一，' +
                 '强化中央对地方的控制，又推行车同轨、书同文、行同伦统一文化风俗，加强了大一统的凝聚力，奠定中国大一统王朝的统治基础，故称“百代都行秦政法” 。' +
                 '秦朝结束了自春秋战国以来五百年来诸侯分裂割据的局面，成为中国历史上第一个多民族共融的中央集权制国家。'},
  { id: 6, name: '汉', detail: ' 汉朝（前202年—220年）是继秦朝之后的大一统王朝，分为西汉、东汉时期，共历29帝，享国四百零七年。' +
                 '因皇室姓刘，故又称刘汉，是中国最强盛的时代之一。' },
  { id: 7, name: '三国（魏 蜀 吴）', detail : '三国（220年－280年）是上承东汉下启西晋的一段历史时期，分为曹魏、蜀汉、东吴三个政权。' +
                 '赤壁之战时，曹操被孙刘联军击败，奠定了三国鼎立的雏型。' },
  { id: 8, name: '晋（东晋 西晋）', detail : ' 晋朝（266年－420年）上承三国下启南北朝，分为西晋与东晋两个时期. ' +
                 '其中西晋为中国历史上大一统王朝之一，东晋则属于六朝之一，两晋共传十五帝，共一百五十五年。' },
  { id: 9, name: '北朝', detail : '北朝（386年—581年），指中国南北朝时期存在于北方五个朝代的总称。北朝包括北魏、东魏、西魏、北齐和北周五朝。' },
  { id: 10, name: '隋', detail : ' 隋朝（581年—618年或619年）是中国历史上承南北朝下继唐朝的大一统王朝。' },
  { id: 11, name: '唐', detail : ' 唐朝（618年—907年），是继隋朝之后的大一统王朝，共历二十一帝，享国二百八十九年, ' +
                  '因皇室姓李，故又称为李唐，是公认的中国最强盛的时代之一。' },
  { id: 12, name: '宋', detail : '宋朝（960年—1279年）是中国历史上承五代十国下启元朝的朝代，分北宋和南宋两个阶段，共历十八帝，享国三百一十九年。' },
  { id: 13, name: '元', detail : '元朝（1271年—1368年），由蒙古族建立，是中国历史上首次由少数民族建立的大一统王朝。' +
                  '定都大都（今北京），传五世十一帝，历时九十八年。' },
  { id: 14, name: '明', detail : '明朝（1368年s ―1644年）是中国历史上最后一个由汉族建立的大一统王朝，共传十六帝，享国二百七十六年。' },
];

